using System.Reflection;
using System.Runtime.CompilerServices;
using System.Runtime.InteropServices;

// Управление общими сведениями о сборке осуществляется с помощью 
// набора атрибутов. Измените значения этих атрибутов, чтобы изменить сведения,
// связанные со сборкой.
[assembly: AssemblyTitle("СГТ-микро")]
[assembly: AssemblyDescription("Система технологического контроля параметров бурения «СГТ-микро» обеспечивает непрерывный контроль и документирование важнейших технологических параметров процесса бурения в реальном масштабе времени с отображением текущей информации в наглядной форме на выносных табло, мониторе компьютера и принтере")]
[assembly: AssemblyConfiguration("")]
[assembly: AssemblyCompany("ЗАО Московское СКБ Ореол")]
[assembly: AssemblyProduct("СГТ-микро")]
[assembly: AssemblyCopyright("Copyright © ЗАО Московское СКБ Ореол,  2012")]
[assembly: AssemblyTrademark("")]
[assembly: AssemblyCulture("")]

// Параметр ComVisible со значением FALSE делает типы в сборке невидимыми 
// для COM-компонентов.  Если требуется обратиться к типу в этой сборке через 
// COM, задайте атрибуту ComVisible значение TRUE для этого типа.
[assembly: ComVisible(false)]

// Следующий GUID служит для идентификации библиотеки типов, если этот проект будет видимым для COM
[assembly: Guid("f42b238a-7c3c-413c-9d18-b62b4d063637")]

// Сведения о версии сборки состоят из следующих четырех значений:
//
//      Основной номер версии
//      Дополнительный номер версии 
//      Номер построения
//      Редакция
//
// Можно задать все значения или принять номер построения и номер редакции по умолчанию, 
// используя "*", как показано ниже:
// [assembly: AssemblyVersion("1.0.*")]
[assembly: AssemblyVersion("1.0.0.0")]
[assembly: AssemblyFileVersion("1.0.0.0")]
